Repository: LAST2526/AppLearnLanguage-app
Catalog: lib/l10n/app_*.arb
Languages: ja, vi

source: Logo
ja: ロゴ

source: Select Language
ja: 言語選択
vi: Chọn ngôn ngữ

# languageVi
source: Vietnamese
ja: ベトナム語
vi: Tiếng Việt

# languageEn
source: English
ja: 英語

# languageJa
source: Japanese
ja: 日本語
vi: Tiếng Nhật

# loginAccountTitle
source: Log in to your account
ja: アカウントにログイン
vi: Đăng nhập vào tài khoản

# loginAccountSubtitle
source: Welcome back. Please enter your details.
ja: お帰りなさい。詳細を入力してください。
vi: Chào mừng bạn quay trở lại. Vui lòng nhập thông tin chi tiết.

# loginByGoogle
source: Login with Google
ja: Googleでログイン
vi: Đăng nhập bằng Google

# loginByFacebook
source: Login with Facebook
ja: Facebookでログイン
vi: Đăng nhập bằng Facebook

source: Or
ja: または
vi: Hoặc

# emailLabel
source: E-mail
ja: メールアドレス

# emailPlaceholder
source: Enter your email address
ja: メールアドレス入力欄
vi: Nhập địa chỉ email

# passwordLabel
source: Password
ja: パスワード
vi: Mật khẩu

# passwordPlaceholder
source: Enter your password
ja: パスワード入力欄
vi: Nhập mật khẩu

# passwordShowIcon
source: Show password icon
ja: パスワード表示のアイコン
vi: Biểu tượng hiển thị mật khẩu

source: Forgot password?
ja: パスワードをお忘れですか？
vi: Quên mật khẩu?

# loginButton
source: Login
ja: ログイン
vi: Đăng nhập

# noAccount
source: Don't have an account? Tap here
ja: アカウントをお持ちでない方はこちら
vi: Chưa có tài khoản? Nhấn vào đây

# registerButton
source: Register
ja: 新規登録
vi: Đăng ký

# registerAccountTitle
source: Register an account
ja: 新規アカウント登録
vi: Đăng ký tài khoản

# registerAccountSubtitle
source: Sign up now to get started with your account.
ja: 今すぐ登録してアカウントを始めましょう。
vi: Đăng ký ngay để bắt đầu với tài khoản của bạn.

source: Register with Google
ja: Googleで登録
vi: Đăng ký bằng Google

source: Register with Facebook
ja: Facebookで登録
vi: Đăng ký bằng Facebook

source: Confirm password
ja: パスワード（確認用）
vi: Mật khẩu (xác nhận)

# alreadyHaveAccount
source: Already have an account?
ja: すでにアカウントをお持ちですか？
vi: Bạn đã có tài khoản?

source: Reset password
ja: パスワード再設定
vi: Đặt lại mật khẩu

# birthdateLabel
source: Date of Birth
ja: 生年月日
vi: Ngày tháng năm sinh

source: Send E-mail
ja: メール送信
vi: Gửi E-mail

# errorForgotPassMessage
source: Email address and birthdate do not match.
ja: メールアドレスと生年月日が一致しません。
vi: Địa chỉ email và ngày sinh không khớp.

# emailSentNotice
source: A new password has been sent to your email. Please check your email.
ja: 新しいパスワードをメールでお送りしました。メールをご確認ください。
vi: Mật khẩu mới đã được gửi qua E-mail. Vui lòng kiểm tra E-mail.

# basicInfo
source: Basic Information
ja: 基本情報
vi: Thông tin cơ bản

source: Full Name
ja: 名前
vi: Họ và tên

source: Name
ja: 名前
vi: Tên

source: Gender
ja: 性別
vi: Giới tính

source: Birthdate
ja: 生年月日
vi: Ngày sinh

source: Nationality
ja: 国籍
vi: Quốc tịch

# residenceCountry
source: Country of Residence
ja: 滞在国
vi: Nơi cư trú

# residenceCountryProfile
source: Current Country of Residence
ja: 滞在国
vi: Quốc gia đang lưu trú

source: Occupation
ja: 職業
vi: Nghề nghiệp

source: Visa Status
ja: 在留資格
vi: Tư cách lưu trú

# visaStatusProfile
source: Type of Visa
ja: 在留資格
vi: Dạng lưu trú

source: Native Language
ja: 母語
vi: Ngôn ngữ mẹ đẻ

# nativeLanguageInputUser
source: Mother tongue
ja: 母語
vi: Tiếng mẹ đẻ

source: Course
ja: コース
vi: Khoá học

source: Save
ja: 保存
vi: Lưu

# maleValue
source: Male
ja: 男性
vi: Nam

# femaleValue
source: Female
ja: 女性
vi: Nữ

# visaStudent
source: Student Visa
ja: 留学生
vi: Du học sinh

# visaIntern
source: Internship
ja: 実習生
vi: Thực tập sinh

# visaTokutei
source: Specified Skilled Worker
ja: 特定技能
vi: Kỹ năng đặc định

# visaOther
source: Other
ja: 他の在留資格
vi: Khác

# courseN3
source: N3 Course
ja: N3コース
vi: Khóa học N3

# changePasswordTitle
source: Change Password
ja: パスワード変更
vi: Thay đổi mật khẩu

# currentPasswordLabel
source: Current Password
ja: 現在のパスワード
vi: Mật khẩu hiện tại

# newPasswordLabel
source: New Password
ja: 新しいパスワード
vi: Mật khẩu mới

# confirmNewPasswordLabel
source: Confirm New Password
ja: 新しいパスワード（確認用）
vi: Mật khẩu mới (xác nhận)

source: Cancel
ja: キャンセル
vi: Huỷ

source: Save Changes
ja: 変更を保存
vi: Lưu thay đổi

# emailError
source: E-mail
ja: メールアドレス

# emailProfile
source: Email
ja: メール

# email_already_exists
source: E-mail is already registered
ja: メールアドレスはすでに登録されています。
vi: E-mail đã được đăng ký

# email_not_found
source: Email address not found
ja: メールアドレスが見つかりません
vi: Không tìm thấy địa chỉ email

# email_invalid
source: Please enter a valid email address.
ja: 有効なメールアドレスの形式で入力してください。
vi: Hãy nhập địa chỉ E-mail hợp lệ.

# email_too_long
source: Email must not exceed 254 characters.
ja: メールアドレスは254文字以内で入力してください。
vi: Email phải nhập không quá 254 ký tự.

# password_too_short
source: Password must be at least 8 characters.
ja: パスワードは8文字以上でなければなりません。
vi: Mật khẩu phải có ít nhất 8 ký tự.

# password_invalid
source: Password must be at least 6 characters and include lowercase, uppercase, numbers, and special characters.
ja: パスワードは、英小文字・英大文字・数字・記号をすべて含む6文字以上で入力してください。
vi: Mật khẩu phải có ít nhất 6 ký tự, bao gồm chữ thường, chữ in hoa, số và ký tự đặc biệt.

# password_too_long
source: Password must not exceed 64 characters.
ja: パスワードは64文字以内で入力してください。
vi: Mật khẩu phải nhập không quá 64 ký tự.

# password_not_correct
source: Incorrect password.
ja: パスワードが間違っています
vi: Mật khẩu không chính xác.

# confirm_password_mismatch
source: Password and Confirm Password do not match.
ja: パスワードとパスワード（確認用）が一致しません。
vi: Mật khẩu và Mật khẩu (xác nhận) không khớp.

# password_same_as_current
source: New password cannot be the same as current password.
ja: 現在のパスワードと新しいパスワードが一致します。
vi: Mật khẩu hiện tại và Mật khẩu mới trùng nhau.

# birthdate_invalid
source: Please enter your birthdate in the format 'yyyy/mm/dd'.
ja: 生年月日は正しい日付形式で入力してください。
vi: Hãy nhập ngày tháng năm sinh theo định dạng 'yyyy/mm/dd'.

# register_failed
source: Registration failed.
ja: 登録できませんでした。
vi: Đăng ký không thành công.

# login_failed
source: Incorrect account or password.
ja: アカウントまたはパスワードが間違っています。
vi: Tài khoản hoặc mật khẩu không chính xác.

# google_token_failed
source: Failed to retrieve token from Google.
ja: Googleからトークンを取得できませんでした。
vi: Không nhận được token từ Google.

# cancelled
source: Login was cancelled by the user.
ja: ユーザーがログインをキャンセルしました。
vi: Người dùng đã huỷ đăng nhập.

# input_email_birthdate
source: Please enter both email and birthdate.
ja: メールアドレスと生年月日を入力してください。
vi: Vui lòng nhập email và ngày sinh.

# password_reset_success_message
source: A new password has been sent to your email. Please check your inbox.
ja: 新しいパスワードをメールでお送りしました。 メールをご確認ください。
vi: Mật khẩu mới đã được gửi tới email của bạn. Vui lòng kiểm tra hộp thư.

# password_reset_success_button
source: Login
ja: ログイン
vi: Đăng nhập

# password_reset_fail_message
source: Email and birthdate do not match.
ja: メールアドレスと生年月日が一致しません。
vi: Địa chỉ email và ngày sinh không khớp.

# password_reset_fail_button
source: OK
ja: 同意する
vi: Đồng ý

# login_success_message
source: Login successful.
ja: ログインに成功しました。
vi: Đăng nhập thành công.

# login_fail_message
source: Login failed. Please check your information.
ja: ログインに失敗しました。情報を確認してください。
vi: Đăng nhập thất bại. Vui lòng kiểm tra lại thông tin.

# change_password_success_message
source: Password changed successfully.
ja: パスワードの変更に成功しました。
vi: Đổi mật khẩu thành công.

# change_password_success_button
source: Go back
ja: 戻る
vi: Quay lại

# change_password_fail_message
source: Password change failed. Please try again.
ja: パスワードの変更に失敗しました。もう一度お試しください。
vi: Đổi mật khẩu thất bại. Vui lòng thử lại.

# register_success_message
source: Account registration successful.
ja: アカウントの登録に成功しました。
vi: Đăng ký tài khoản thành công.

# register_fail_message
source: Registration failed. Please check your information.
ja: 登録に失敗しました。情報を確認してください。
vi: Đăng ký thất bại. Vui lòng kiểm tra lại thông tin.

# login_cancelled
source: You cancelled the login
ja: ログインをキャンセルしました
vi: Bạn đã hủy đăng nhập

# learn_to_study
source: Learning!
ja: 覚えよう！
vi: Chưa nhớ!

# known
source: Review!
ja: もう少し！
vi: Ôn thêm chút!

# learned
source: Mastered!
ja: 覚えた！
vi: Đã nhớ!

# flash_card_title
source: Topic
ja: トピックの名前
vi: Chủ đề

# left_guide_bold
source: swipe left
ja: 左にスワイプしてください
vi: hãy vuốt sang trái

# left_guide_normal
source: If you don't remember
ja: 覚えていない場合は
vi: Nếu chưa nhớ

# right_guide_bold
source: swipe right
ja: 右にスワイプしてください
vi: hãy vuốt sang phải

# right_guide_normal
source: If you remember
ja: 覚えた場合は
vi: Nếu đã nhớ

# unknown_label
source: Don't remember
ja: 覚えていない
vi: Chưa nhớ

# known_label
source: Remembered
ja: 覚えた
vi: Đã nhớ

# done_flash_card
source: Lesson completed.
ja: すべて勉強しました。
vi: Đã hoàn thành bài học.

# error_server
source: A system error occurred. Please try again later.
ja: システムエラーが発生しました。もう一度お試しください。
vi: Đã xảy ra lỗi hệ thống. Hãy thử lại sau.

# auto_next
source: Auto play
ja: 次に再生
vi: Phát tiếp

# play_random
source: Shuffle play
ja: シャッフル再生
vi: Phát ngẫu nhiên

# show_script
source: Show subtitles
ja: スクリプト表示
vi: Hiển thị phụ đề

source: Example
ja: 例文
vi: Ví dụ

# audio
source: Conversation
ja: 読んでみよう
vi: Hội thoại

# account_label
source: Account
ja: アカウント
vi: Tài khoản

# update_info
source: Edit information
ja: プロフィール編集
vi: Chỉnh sửa thông tin

# update_confirm
source: Update
ja: 更新
vi: Cập nhật

# update_info_label
source: Basic Information
ja: 基本情報
vi: Thông tin cơ bản

# user_info
source: User Information
ja: ユーザの情報
vi: Thông tin người dùng

# system_setting
source: Settings
ja: システム設定
vi: Cài đặt

source: Change Password
ja: パスワード変更
vi: Thay đổi mật khẩu

# language_setting
source: Language Selection
ja: 言語選択
vi: Chọn ngôn ngữ

source: App Version
ja: アプリバージョン
vi: Phiên bản cập nhật

source: Log Out
ja: ログアウト
vi: Đăng xuất

source: Scan QR Code
ja: QAコード読み取り
vi: Quét mã QR

source: QR Code
ja: QAコード
vi: Mã QR

# n3_exam
source: N3 Exam Practice
ja: N3の試験対策
vi: Luyện thi N3

# flashcard
source: Vocabulary Flashcards
ja: フラッシュカード
vi: Thẻ từ vựng

source: Progress
ja: 学習進捗
vi: Tiến độ

# voice
source: Listen
ja: 音声
vi: Nghe

# dialog_unlock_desc
source: Enter the book code that comes with the exam prep book to unlock all content.
ja: すべての教材を学習できるように、試験対策本に付属しているブックコードを入力してコンテンツを解除してください。
vi: Nhập mã sách kèm theo sách luyện thi để mở khóa toàn bộ nội dung.

source: Book Code
ja: ブックコード
vi: Mã sách

# book_code_invalid
source: Please enter a valid book code format.
ja: ブックコードは正しい形式で入力してください。
vi: Vui lòng nhập mã sách đúng định dạng.

source: Unlock
ja: 解除
vi: Mở khóa

# no_data_value
source: No data available to display
ja: 現在表示するデータはありません。
vi: Hiện tại không có dữ liệu hiển thị

# qr_invalid_title
source: Invalid QR Code.
ja: 無効なQAコードです。
vi: Mã QA không hợp lệ.

# qr_invalid_message
source: Please scan a valid QR code.
ja: 有効なQAコードをスキャンしてください。
vi: Hãy quét mã QA hợp lệ.

# title_list_notification
source: Notifications
ja: 通知
vi: Thông báo

source: Mark all as read
ja: 一括既読み
vi: Đọc tất cả thông báo

# registerNotify
source: Register
ja: 申し込み
vi: Đăng ký

# closeDialogNotify
source: Close
ja: 閉じる
vi: Đóng

# noNotify
source: You have no notifications
ja: 通知はありません
vi: Bạn không có thông báo nào

# mailSentMessage
source: Email sent to {email}
ja: {email}にメールを送りました。
vi: Đã gửi mail đến {email}

# fromLibrary
source: Choose from Library
ja: ライブラリから選択
vi: Chọn từ thư viện

# takePicture
source: Take Photo
ja: 写真を撮影
vi: Chụp ảnh

# validation_required
source: Please enter {field}.
ja: {field}を入力してください。
vi: Hãy nhập {field}.

# validation_max_length
source: {field} must be no more than {number} characters.
ja: {field}は{number}文字以内で入力してください。
vi: {field} phải nhập không quá {number} ký tự.

# new_password_invalid
source: New password is invalid
ja: 新しいパスワードを入力してください。
vi: Mật khẩu mới không đúng

# error_common
source: Error
ja: エラー
vi: Lỗi
